[
  {
    "id": "bhagavad-gita-as-it-is",
    "name": "Bhagavad Gita As It Is",
    "author": "A.C. Bhaktivedanta Swami Prabhupada",
    "img": "/images/Books/BhagavadGita.webp",
    "rating": 4.5,
    "genre": "Spiritual, Philosophy, Religious, Self-Help, Classic Literature",
    "description": "Bhagavad Gita As It Is by A.C. Bhaktivedanta Swami Prabhupada presents the timeless divine conversation between Lord Krishna and Arjuna on the battlefield of Kurukshetra. Through clear translations and insightful commentary, Prabhupada explains the profound teachings of the Gita on duty, devotion, and the path to self-realization. This edition emphasizes understanding the Gita “as it is,” without interpretation, guiding readers toward spiritual clarity and inner peace."
  },
  {
    "id": "ramayana",
    "name": "Ramayana",
    "author": "Valmiki",
    "img": "/images/Books/Ramayana.jpg",
    "rating": 4.5,
    "genre": "Epic, Mythology, Religious, Classic",
    "description": "Ramayan by Maharshi Valmiki is one of the greatest ancient epics of India, narrating the divine journey of Lord Rama, an incarnation of Vishnu. It follows his exile, the abduction of his wife Sita by Ravana, and the epic battle to restore dharma and righteousness. Filled with devotion, heroism, and moral lessons, the Ramayan beautifully portrays the victory of good over evil and the ideals of love, duty, and honor."
  },
  {
    "id": "mahabharat",
    "name": "Mahabharat",
    "author": "Vyasa",
    "img": "/images/Books/Mahabharat.jpg",
    "rating": 4.7,
    "genre": "Epic, Mythology, Philosophy, Classic",
    "description": "Mahabharat by Maharshi Vyasa is one of the longest and most profound epics in world literature. It tells the story of the great Kurukshetra war between the Pandavas and Kauravas, exploring themes of duty, justice, truth, and destiny. Within its verses lies the Bhagavad Gita, a timeless guide to life and spirituality. The Mahabharat reveals the complexity of human nature and the eternal struggle between righteousness and ambition."
  },
  {
    "id": "pursuit-of-happyness",
    "name": "The Pursuit of Happyness",
    "author": "Chris Gardner",
    "img": "/images/Books/PursuitOfHappyness.jpg",
    "rating": 4.3,
    "genre": "Biography, Motivation, Non-fiction",
    "description": "The story of Chris Gardner's struggle with homelessness while raising his son and pursuing a better life."
  },
  {
    "id": "harry-potter-1",
    "name": "Harry Potter and the Philosopher's Stone",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter1.jpg",
    "rating": 4.0,
    "genre": "Fantasy, Fiction, Magic Adventure, Coming-of-Age",
    "description": "A young boy discovers he's a wizard and attends Hogwarts, uncovering secrets about his past."
  },
  {
    "id": "harry-potter-2",
    "name": "Harry Potter and the Chamber of Secrets",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter2.jpg",
    "rating": 4.1,
    "genre": "Fantasy, Adventure, Magic",
    "description": "Harry returns to Hogwarts and discovers a hidden chamber that holds a deadly secret."
  },
  {
    "id": "harry-potter-3",
    "name": "Harry Potter and the Prisoner of Azkaban",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter3.jpg",
    "rating": 4.2,
    "genre": "Fantasy, Adventure, Magic",
    "description": "Harry learns the truth about Sirius Black, a mysterious prisoner with ties to his family."
  },
  {
    "id": "harry-potter-4",
    "name": "Harry Potter and the Goblet of Fire",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter4.jpg",
    "rating": 4.3,
    "genre": "Fantasy, Adventure, Magic Tournament",
    "description": "Harry faces deadly challenges in the Triwizard Tournament while a dark power rises."
  },
  {
    "id": "harry-potter-5",
    "name": "Harry Potter and the Order of the Phoenix",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter5.jpg",
    "rating": 4.2,
    "genre": "Fantasy, Magic, Rebellion",
    "description": "Harry forms Dumbledore's Army to fight the growing darkness within the wizarding world."
  },
  {
    "id": "harry-potter-6",
    "name": "Harry Potter and the Half-Blood Prince",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter6.jpg",
    "rating": 4.3,
    "genre": "Fantasy, Mystery, Magic",
    "description": "Harry uncovers Voldemort's past and learns about Horcruxes in this darker chapter."
  },
  {
    "id": "harry-potter-7-1",
    "name": "Harry Potter and the Deathly Hallows: Part 1",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter7.jpg",
    "rating": 4.4,
    "genre": "Fantasy, Adventure, Magic",
    "description": "Harry, Ron, and Hermione go on the run to find and destroy Voldemort's Horcruxes."
  },
  {
    "id": "harry-potter-7-2",
    "name": "Harry Potter and the Deathly Hallows: Part 2",
    "author": "J.K. Rowling",
    "img": "/images/Books/HarryPotter8.jpg",
    "rating": 4.5,
    "genre": "Fantasy, War, Magic",
    "description": "The epic final battle between good and evil unfolds at Hogwarts."
  },
  {
    "id": "lord-of-the-rings",
    "name": "The Lord of The Rings",
    "author": "J.R.R. Tolkien",
    "img": "/images/Books/TheLordOfTheRings.jpg",
    "rating": 4.9,
    "genre": "Fantasy, Adventure, Epic, Classic",
    "description": "A fellowship embarks on a perilous journey to destroy the One Ring and defeat Sauron."
  },
  {
    "id": "chronicles-of-narnia",
    "name": "The Chronicles of Narnia",
    "author": "C.S. Lewis",
    "img": "/images/Books/ChroniclesofNarnia.jpg",
    "rating": 4.6,
    "genre": "Fantasy, Adventure, Children's Classic",
    "description": "A magical wardrobe transports children into the mythical land of Narnia ruled by Aslan."
  },
  {
    "id":"percy-jackson",
    "name":"The Last Olympian",
    "author":"Rick Riordan",
    "img":"/images/Books/PercyJackson.jpg",
    "rating":4.55,
    "genre":"Fantasy, Mythology, Greek Mythology, Fiction",
    "description": "In the thrilling conclusion of the Percy Jackson and the Olympians series, Percy leads his friends in a desperate battle to defend Mount Olympus from the forces of Kronos. As New York City becomes the final battleground, Percy must face his destiny and make a choice that could change the fate of the gods and mortals forever."
  },
  {
    "id": "ek-chihan",
    "name": "एक चिहान (Ek Chihan)",
    "author": "Bishweshwar Prasad Koirala",
    "img": "/images/Books/ekChihan.jpg",
    "rating": 4.1,
    "genre": "Nepali Literature, Fiction, Political",
    "description": "A Nepali classic exploring themes of human struggle, politics, and morality. Through simple yet profound storytelling, Koirala explores themes of love, guilt, and the psychological struggles within the human mind. The story reflects his mastery of blending realism with deep philosophical insight, making it one of the finest works in Nepali literature."
  },
  {
    "id": "muna-madan",
    "name": "मुनामदन (Muna Madan)",
    "author": "Laxmi Prasad Devkota",
    "img": "/images/Books/MunaMadan.jpg",
    "rating": 4.8,
    "genre": "Poetry, Nepali Literature, Classic",
    "description": "Muna Madan by Laxmi Prasad Devkota is one of the most celebrated epics in Nepali literature, written in lyrical verse. It tells the tragic love story of Muna and Madan, depicting the pain of separation, the harsh realities of life, and the value of humanity over wealth. Through its emotional depth and poetic beauty, the work highlights Devkota's message that true greatness lies in compassion and love for others."
  },
  {
    "id": "rich-dad-poor-dad",
    "name": "Rich Dad Poor Dad",
    "author": "Robert T. Kiyosaki",
    "img": "/images/Books/RichDadPoorDad.jpg",
    "rating": 4.2,
    "genre": "Finance, Self-help, Motivation",
    "description": "Rich Dad Poor Dad by Robert T. Kiyosaki is a life-changing personal finance book that challenges traditional views about money and success. Through the contrast between his “rich dad” and “poor dad,” Kiyosaki shares lessons on financial independence, investing, and building wealth through smart decisions. It teaches how to make money work for you, not the other way around, inspiring readers to think differently about income, assets, and opportunities."
  },
  {
    "id": "shireesh-ko-phool",
    "name": "Shireesh ko Phool",
    "author": "Parijat",
    "img": "/images/Books/Shireesh-ko-Phool.webp",
    "rating": 4.4,
    "genre": "Nepali Literature, Psychological Fiction",
    "description": "A deeply emotional Nepali novel exploring love, pain, and the complexities of human emotion."
  },
  {
    "id": "great-gatsby",
    "name": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "img": "/images/Books/GreatGatsby.jpg",
    "rating": 4.3,
    "genre": "Classic, Fiction, Tragedy, Romance",
    "description": "A tragic story of wealth, love, and obsession set in the Jazz Age of America."
  },
  {
    "id": "alex-ferguson",
    "name": "Alex Ferguson: My Autobiography",
    "author": "Sir Alex Ferguson",
    "img": "/images/Books/AlexFerguson.jpg",
    "rating": 4.6,
    "genre": "Biography, Sports, Leadership",
    "description": "The inspiring life story of football's most successful manager, sharing lessons from his career."
  },
  {
    "id": "lolita",
    "name": "Lolita",
    "author": "Vladimir Nabokov",
    "img": "/images/Books/Lolita.jpg",
    "rating": 3.87,
    "genre": "Psychological Fiction, Literary Classic, Tragic Romance",
    "description": "Lolita by Vladimir Nabokov is a mesmerizing masterpiece that blends beauty, obsession, and tragedy into one unforgettable story. Through the eyes of Humbert Humbert, a charming yet deeply flawed narrator, readers are drawn into a world of forbidden love and emotional turmoil. Nabokov's poetic writing, dark humor, and intricate storytelling make every page both unsettling and captivating. It's a book that challenges your emotions and lingers in your mind long after the last line."
  },
  {
    "id": "don-quixote",
    "name": "Don Quixote",
    "author": "Miguel de Cervantes",
    "img": "/images/Books/DonQuixote.jpg",
    "rating": 4.87,
    "genre": "Classic Literature, Adventure, Sattire, Comedy",
    "description": "Don Quixote, or The Ingenious Gentleman Don Quixote of La Mancha, by Miguel de Cervantes, is one of the greatest works in world literature. It tells the story of a nobleman who, inspired by tales of chivalry, sets out on a quest to revive knighthood with his loyal squire, Sancho Panza. Their adventures are filled with humor, wisdom, and a touching exploration of dreams versus reality. This timeless classic celebrates imagination, courage, and the beauty of believing in one's ideals—even against all odds."
  },
  {
    "id":"1984",
    "name": "1984",
    "author": "George Orwell, Thomas Pinchon (Foreword)",
    "img": "/images/Books/1984.jpg",
    "rating": 4.20,
    "genre": "Dystopian Fiction, Political Fiction, Classic Literature",
    "description": "1984 by George Orwell, with a foreword by Thomas Pynchon, is a gripping dystopian novel set in a totalitarian world ruled by Big Brother. It follows Winston Smith, a man who dares to question a regime that controls every thought, word, and memory. Orwell masterfully portrays the dangers of surveillance, propaganda, and loss of freedom. Chilling, thought-provoking, and timeless, 1984 is a must-read that makes you question the true meaning of truth and freedom"
  },
  {
    "img": "/images/Books/AtomicHabits.jpg",
    "id": "atomic-habits",
    "name": "Atomic Habits",
    "author": "James Clear",
    "rating": 4.33,
    "genre" : "Self-Help, Personal Development, Psychology, Productivity",
    "description": "Atomic Habits by James Clear is a transformative guide that shows how small, consistent changes can lead to remarkable results. Clear explains the science behind habit formation and offers practical strategies to build good habits, break bad ones, and master the tiny behaviors that lead to success. Packed with real-life examples and actionable advice, this book empowers you to reshape your identity and take control of your personal and professional growth."
  },
  {
    "img": "/images/Books/TheLawsOfHumanNature.jpg",
    "id": "Laws-of-human-nature",
    "name": "The Laws of Human Nature",
    "author": "Robert Greene",
    "rating": 4.35,
    "genre" : "Psychology, Self-Help, Philosophy, Personal Development",
    "description": "The Laws of Human Nature by Robert Greene is a profound exploration of what truly drives people’s behavior. Greene uncovers the hidden motivations, emotions, and social forces that shape human actions, helping readers understand themselves and others on a deeper level. Through historical examples and psychological insights, the book teaches how to master self-awareness, influence others, and navigate complex social dynamics with wisdom."
  },
  {
    "img": "/images/Books/Power.png",
    "id": "The-48-Laws-of-Power",
    "name": "The 48 Laws of Power",
    "author": "Robert Greene",
    "rating": 4.09,
    "genre": "Self-Help, Strategy, Psychology, Leadership, Philosophy",
    "description": "The 48 Laws of Power by Robert Greene is a timeless manual on understanding power dynamics and achieving influence in any situation. Drawing from the lives of historical figures like Machiavelli, Sun Tzu, and Napoleon, Greene presents 48 principles for gaining, defending, and mastering power. Each law is filled with real-life lessons, psychological insights, and strategies to help you navigate competition and human behavior effectively."
  },
  {
    "img": "/images/Books/Mastery.png",
    "id": "Mastery",
    "name": "Mastery",
    "author": "Robert Greene",
    "rating": 4.0,
    "genre": "Self-Help, Psychology, Personal Growth, Leadership",
    "description":"Mastery by Robert Greene is a powerful guide to unlocking your highest potential by learning from the world's greatest masters. Through stories of figures like Leonardo da Vinci, Charles Darwin, and modern innovators, Greene reveals how dedication, practice, and intuition lead to true excellence. The book shows that mastery isn't about talent—it's about persistence, passion, and lifelong learning. It inspires readers to find their life's calling and rise above mediocrity"
  },
  {
    "img": "/images/Books/Psychology_of_Money.jpg",
    "id": "Psychology-of-Money",
    "name": "The Psychology of Money",
    "author": "Morgan Housel",
    "rating": 4.2,
    "genre": "Finance, Psychology, Personal Development, Self-Help",
    "description": "The Psychology of Money by Morgan Housel explores how our thoughts, emotions, and behaviors shape the way we handle money. Instead of focusing on complex formulas, Housel shares timeless stories and insights about luck, risk, and human behavior in financial decisions. The book reveals that managing money is less about what you know and more about how you behave. It's a must-read for anyone who wants to build lasting wealth and peace of mind."
  }
]
